In [1]:
import pandas as pd
df=pd.DataFrame({"sub1":[12,13,14],"sub2":[10,14,13],"sub3":[12,15,14]})
df

   sub1  sub2  sub3
0    12    10    12
1    13    14    15
2    14    13    14

In [23]:
df.iloc[0:2,[0,2]]
df.iloc[1]

sub1    13
sub2    14
sub3    15
Name: 1, dtype: int64

In [19]:
df.loc[0:1,"sub1":"sub3"]
df.loc[df.sub1==12]
df.loc[:]

   sub1  sub2  sub3
0    12    10    12
1    13    14    15
2    14    13    14

In [4]:
df.dtypes

sub1    int64
sub2    int64
sub3    int64
dtype: object

In [9]:
df["sub2"]=df["sub2"].astype(float)

In [10]:
df

   sub1  sub2  sub3
0    12  10.0    12
1    13  14.0    15
2    14  13.0    14

In [11]:
df.dtypes

sub1      int64
sub2    float64
sub3      int64
dtype: object

In [13]:
    df.rename({"sub2":"fsub2"},axis=1)

   sub1  fsub2  sub3
0    12   10.0    12
1    13   14.0    15
2    14   13.0    14

In [14]:
df.rename({0:1,1:2,2:3})

   sub1  sub2  sub3
1    12  10.0    12
2    13  14.0    15
3    14  13.0    14

In [19]:
df.sort_values(by="sub2")

   sub1  sub2  sub3
0    12  10.0    12
2    14  13.0    14
1    13  14.0    15

In [27]:
df.sort_values(by=0,axis=1)

   sub2  sub1  sub3
0  10.0    12    12
1  14.0    13    15
2  13.0    14    14

In [28]:
df[["sub2","sub1","sub3"]]

   sub2  sub1  sub3
0  10.0    12    12
1  14.0    13    15
2  13.0    14    14

In [29]:
df.iloc[[1,0,2]]

   sub1  sub2  sub3
1    13  14.0    15
0    12  10.0    12
2    14  13.0    14